var Input=document.querySelector('#name');
function display(){
let msg=[{ans:"நம்பிக்கை வெற்றியோடு வரும். ஆனால் வெற்றி நம்பிக்கை உள்ளோரிடம் மட்டுமே வரும்"},
    {ans:"மனம் உங்களைக் கட்டுப்படுத்தும் முன் உங்கள் மனதைக் கட்டுப்படுத்துங்கள்"},
    {ans:"நீங்கள் நிறுத்தாத வரை எவ்வளவு மெதுவாகச் சென்றாலும் பரவாயில்லை."},
    {ans:"தைரியம் பயத்தை விட ஒரு படி மேலே உள்ளது."},
    {ans:"அறிவை விட முக்கியமானது, உங்கள் இலக்கை அடைய உங்கள் விருப்பம்."},
    {ans:"செய்ய முடிந்தவன் சாதிக்கிறான், செய்ய முடியாதவன் போதிக்கிறான்."},
    {ans:"மலையைப் பார்த்து மலைத்து விடாதே, மலை மீது ஏறினால் அதுவும் உன் காலடியில்."},
    {ans:"முயலும் வெல்லும், ஆமையும் வெல்லும், ஆனால் முயலாமை என்றுமே வெல்லாது."},
    {ans:"இன்று நீங்கள் உணரும் வலி நாளை நீங்கள் உணரும் பலமாக இருக்கும்."},
    {ans:"நாம் வலியைத் தழுவி, அதை நமது பயணத்திற்கு எரிபொருளாக எரிக்க வேண்டும்."},
    {ans:"வெற்றி இலக்கை அடைய தோல்விகள் படிகட்டுகள்."},
    {ans:"ஒரு சிக்கல் உங்கள் சிறந்ததைச் செய்வதற்கான வாய்ப்பாகும்."},
    {ans:"உங்களால் பறக்க முடியாவிட்டால் ஓடுங்கள்."},
    {ans:"பழைய பழக்கங்கள் புதிய பாதைகளைத் திறக்காது."},
    {ans:"ஒரு மனிதன் தன்னை உலகிற்கு புத்திசாலி என்று நிரூபிப்பதை நிறுத்தும்போது வெற்றி பெறுகிறான்."},
    {ans:"விழுவதெல்லாம் எழுவதற்குத்தானே தவிர அழுவதற்கு அல்ல."},
    {ans:"நீ இன்று செய்யும் சின்ன சின்ன முயற்சிகள் நாளை மாறும் வெற்றியின் ஆணி வேர்கள்."},
    {ans:"கிடைக்கும் வாய்ப்புகளைப் பயன்படுத்தி வெற்றிக் கனியை எட்டுபவனே சிறந்த சாமர்த்தியசாலி ஆகிறான்."},
    {ans:"சிந்தனை மட்டும் செய்ய உனக்கு தெரியுமானால் நீயே உனக்கான மிகச்சிறந்த ஆலோசகர்."},
    {ans:"நம்மீது நம்பிக்கை நமக்கிருக்கும் வரை வாழ்க்கை நம்வசம்."},
    {ans:"உறுதியுடன் எழுந்திருங்கள். திருப்தியுடன் படுக்கைக்குச் செல்லுங்கள்."},
    {ans:"வெற்றிக்கான திறவுகோல் தடைகளில் அல்ல, இலக்குகளில் கவனம் செலுத்துவதாகும்."},
    {ans:"நீங்களே கட்டியெழுப்பும் சுவர்களால் மட்டுமே நீங்கள் அடைக்கப்பட்டுள்ளீர்கள்."},
    {ans:"தன்னம்பிக்கை கொண்ட மனிதன் மற்றவர்களின் நம்பிக்கையைப் பெறுகிறான்."},
    {ans:"நாம் ஒளிந்து கொள்ளும் பெண் மான்கள் அல்ல, ஒளி வீசப்போகும் விண்மீன்கள்."},
    {ans:"உன் திறமையை வெளி காட்டு, உலகம் உன்னை கண்டறியும்."},
    {ans:"அற்புதமான ஒன்று நடக்கப்போகிறது என்று எப்போதும் நம்புங்கள்."},
    {ans:"கற்றவர்களிடம் கற்பதை விட கற்றுக்கொண்டிருப்பவர்களிடம் கற்றுக்கொள்."},
    {ans:"நீங்கள் செய்யாவிட்டால் கனவுகள் செயல்படாது."},
    {ans:"தோல்வி வெற்றிக்கு நேர்மாறானது அல்ல, அது வெற்றியின் ஒரு பகுதியாகும்."},
    {ans:"உலகில் நீங்கள் காண விரும்பும் மாற்றமாக இருங்கள்."},
    {ans:"அமைதியாய் இருப்பவனை முட்டாள் என எண்ணிவிடாதே, பேசுபவனை விட கேட்பவனே புத்திசாலி."},
    {ans:"வாழ நினைப்பவனுக்கு வானம் கூட வாயிற் படி தான்."},
    {ans:"விதைத்தவன் உறங்கலாம். ஆனால் விதைகள் ஒருபோதும் உறங்குவதில்லை."},
    {ans:"ஆயிரம் தடைகள் வந்தாலும் அதை உடைத்தெறிந்து முன்னேறு."},
    {ans:"உங்கள் சொந்த கனவுகளை உருவாக்குங்கள், அல்லது வேறு யாராவது உங்களைக் கட்டியெழுப்புவார்கள்."},
    {ans:"பெரிய வேலையைச் செய்வதற்கான ஒரே வழி, நீங்கள் செய்வதை நேசிப்பதே."},
    {ans:"நீங்கள் அதை கனவு காண முடிந்தால், நீங்கள் அதை அடைய முடியும்."},
    {ans:"உங்கள் உறுதியும் விடாமுயற்சியும் உங்களை ஒரு வெற்றிகரமான நபராக மாற்றும்."},
    {ans:"செயல் அனைத்து வெற்றிகளுக்கும் அடித்தளமாகும்."},
    {ans:"கஷ்டங்கள் வந்து கொண்டே தான் இருக்கும். நாம் கடந்து சென்று கொண்டே இருப்போம்."},
    {ans:"சாமர்த்தியம் இருந்தால் எதையும் சமாளிக்கலாம். தைரியம் இருந்தால் எப்படியும் சாதிக்கலாம்."},
    {ans:"வெற்றி என்பது கொடுத்து பெறுவது அல்ல முயன்று அடைவது."},
    {ans:"நீங்கள் முயற்சியை கைவிடாதவரை, வெற்றியும் உங்களை கைவிடுவதில்லை. "},
    {ans:"நம் வாழ்வில் எல்லாம் ஒரு நாள் மாறும். ஆனால் ஒரே நாளில் மாறிவிடாது."},
    {ans:"அவரைப்போல் இவரைப்போல் இல்லாமல் உன்னைப்போல் வாழ்ந்து காட்டு."},
    {ans:"முயற்சி செய்ய தயங்காதே, முயலும் போது முட்களும் உன்னை முத்தமிடும்."},
];
var ins=Input.value;
var cal=Math.floor(Math.random()*msg.length)+ins.length;
var b=msg[cal].ans;
alert(b)
}
var action=document.querySelector('button');
action.addEventListener('click',()=>{
    display();
    Input.value='';
});
